espressif/esp-idf/tools/test_apps/system/memprot/sdkconfig.ci
# Esp32S2 only
CONFIG_IDF_TARGET="esp32s2"

# Disable automatic memory protection
CONFIG_ESP32S2_MEMPROT_FEATURE=n
